# Part 3 : Model Evaluation

## Setup libraries

In [ ]:
import subprocess, sys
import torch, json
import pandas as pd
from tqdm import tqdm
from transformers import AutoModelForCausalLM, AutoTokenizer, BitsAndBytesConfig, TrainingArguments, Trainer, DataCollatorForLanguageModeling
from peft import LoraConfig, TaskType, get_peft_model, PeftModel
# from trl import SFTTrainer, DataCollatorForCompletionOnlyLM
from datasets import load_dataset
from torch.utils.data import Dataset, DataLoader

c:\Users\ksimotabudjifupa\Documents\Personnel\Data_science_projects\sql_copilot\venv\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm
c:\Users\ksimotabudjifupa\Documents\Personnel\Data_science_projects\sql_copilot\venv\Lib\site-packages\sklearn\utils\_param_validation.py:14: UserWarning: A NumPy version >=1.22.4 and <2.3.0 is required for this version of SciPy (detected version 2.3.1)
  from scipy.sparse import csr_matrix, issparse

## Device Checking

In [4]:
device = "cuda" if torch.cuda.is_available() else "cpu"
device

'cuda'

## Evaluation of the the Phi2_Text_To_SQL model

In [14]:
# Functions definition

def generate_text(prompt, model, max_new_tokens=2048):
    encoding = tokenizer(prompt, return_tensors="pt")
    input_ids = encoding['input_ids'].to(device)
    attention_mask = encoding['attention_mask'].to(device)

    with torch.no_grad():
        output_ids = model.generate(input_ids, attention_mask=attention_mask, max_new_tokens=max_new_tokens, pad_token_id=tokenizer.eos_token_id, do_sample=False)

    generated_text = tokenizer.decode(output_ids[0], skip_special_tokens=True)
    return generated_text

def extract_sql(text):
    # Support different possible answer labels
    for key in ["Answer:", "Anwser:", "SQL:"]:
        if key in text:
            # Get everything after the key (Answer/Anwser/SQL)
            answer_section = text.split(key, 1)[1]
            # Stop if there’s another Question coming
            answer_only = answer_section.split("Question:", 1)[0].strip()
            # Clean and filter lines
            lines = [line.strip() for line in answer_only.splitlines() if line.strip()]
            # Ignore lines that repeat instructions
            if not lines or all(any(x in line for x in ["Convert", "Return", "Question"]) for line in lines):
                return "[NO SQL GENERATED]"
            sql = "\n".join(lines)
            # Ensure semicolon at the end
            if not sql.endswith(";"):
                sql += ";"
            return sql
    return "[NO SQL GENERATED]"


def generate_predictions_from_dataframe(df, max_length):
    predictions = []

    for question in tqdm(df['question'], desc="Generating SQL queries"):
        instruction = instruction = f"""You are a Text-to-SQL assistant. 
        Convert the following question into a valid SQL query. 
        Return only the SQL query and end it with a semicolon.

        Question: {question}
        Anwser:"""

        generated = generate_text(instruction, trainable_model, max_length)
        sql = extract_sql(generated)
        predictions.append(sql)
    return predictions

def save_predictions_to_file(predictions, filename="./data/sql/dev_pred.sql"):
    with open(filename, "w") as f:
        for sql in predictions:
            f.write(sql.strip() + "\n")
    print(f"✅ Sauvegardé dans {filename}")

def generate_gold_data_from_dataframe(df, max_length):
    gold_data = []
    for query, db_id in tqdm(zip(df['query'],df['db_id'])):
        if not query.endswith(";"):
            query += ";"
        gold_data.append((query,db_id))
    return gold_data

def save_gold_data_to_file(gold_data, filename="./data/sql/dev_gold.sql"):
    with open(filename, "w") as f:
        for query, db in gold_data:
            f.write(f"{query.strip()}\t{db.strip()}\n")
    print(f"✅ Sauvegardé dans {filename}")

### Model Quantization

In [5]:
# Quantization Config
bnb_config = BitsAndBytesConfig(
    load_in_4bit=True,
    bnb_4bit_use_double_quant=True,
    bnb_4bit_quant_type="nf4",
    bnb_4bit_compute_dtype=torch.bfloat16
)

base_model = AutoModelForCausalLM.from_pretrained("./models/base_Phi2_model", quantization_config=bnb_config, trust_remote_code=False, device_map="auto")
trainable_model = PeftModel.from_pretrained(base_model, "./models/Text2SQL_Phi2_model", is_trainable=True)
tokenizer = AutoTokenizer.from_pretrained("./models/Text2SQL_Phi2_model", trust_remote_code=True, use_fast=False)

Loading checkpoint shards: 100%|██████████| 3/3 [00:28<00:00,  9.47s/it]

### dev_pred and gold_pred creation

In [15]:
# gold_pred.sql database

data_spider = load_dataset("xlangai/spider")
data_spider_train = load_dataset("xlangai/spider", split="train")
data_spider_validation = load_dataset("xlangai/spider", split="validation")

df_spider_train = data_spider_train.to_pandas()
df_spider_validation = data_spider_validation.to_pandas()
frames_spider = [df_spider_train,df_spider_validation]
df_spider = pd.concat(frames_spider)
df_spider_study = df_spider[["query","question","db_id"]]
df_spider_study.to_csv("./data/spider_query_db_id.csv",sep=";",index=False)

df = pd.read_csv("./data/spider_query_db_id.csv", sep=";", nrows=3000) 
max_length = df['query'].apply(lambda x: len(str(x).split())).max()
predictions = generate_gold_data_from_dataframe(df,max_length)
save_gold_data_to_file(predictions)

with open("./data/sql/dev_gold.sql", "r", encoding="utf-8") as f:
    for i, line in enumerate(f, 1):
        sql = line.strip().split("\t")[0]
        if sql.count(";") > 1:
            print(f"⚠️ Line {i} - Multi-statement SQL:", sql)

3000it [00:00, 2914060.21it/s]

✅ Sauvegardé dans ./data/sql/dev_gold.sql

In [ ]:
# dev_pred.sql database

df = pd.read_csv("./data/query_question_sql_copilot.csv", sep=";", nrows=3000) 
max_length = df['query'].apply(lambda x: len(str(x).split())).max()
predictions = generate_predictions_from_dataframe(df,max_length)
save_predictions_to_file(predictions)

with open('./pred/dev_pred.sql', 'r') as file:
    lines = file.readlines()

merged_lines = []
buffer = ""

for line in lines:
    stripped = line.strip()
    if stripped:
        buffer += " " + stripped
        if stripped.endswith(';'):
            merged_lines.append(buffer.strip())
            buffer = ""

with open('./pred/dev_pred_corrected.sql', 'w') as file:
    for merged in merged_lines:
        file.write(merged + '\n')

### Model evaluation

In [ ]:
# Evaluation 

cmd = [
    sys.executable, "evaluation.py",
    "--gold", "./data/sql/dev_gold.sql",
    "--pred", "./data/sql/dev_pred.sql",
    "--db", "./data/spider/database",
    "--table", "./data/spider/tables.json",
    "--etype", "all",
]

# Affiche les logs en temps réel
with subprocess.Popen(cmd, stdout=subprocess.PIPE, stderr=subprocess.STDOUT, text=True) as proc:
    for line in proc.stdout:
        print(line, end="")  # end="" évite les sauts de ligne en double

# Vérifie le code de retour
if proc.returncode not in (0, None):
    raise subprocess.CalledProcessError(proc.returncode, cmd)

c:\Users\ksimotabudjifupa\Documents\Personnel\Data_science_projects\sql_copilot\venv\Lib\site-packages\nltk\metrics\association.py:26: UserWarning: A NumPy version >=1.22.4 and <2.3.0 is required for this version of SciPy (detected version 2.3.1)
  from scipy.stats import fisher_exact
eval_err_num:1
easy pred: SELECT COUNT(*) FROM department WHERE age > 56;
easy gold: SELECT count(*) FROM head WHERE age  >  56;

eval_err_num:2
medium pred: SELECT name, born_state, age FROM heads_of_departments ORDER BY age;
medium gold: SELECT name ,  born_state ,  age FROM head ORDER BY age;

eval_err_num:3
medium pred: SELECT year, name, budget FROM departments;
medium gold: SELECT creation ,  name ,  budget_in_billions FROM department;

eval_err_num:4
medium pred: SELECT MAX(budget) AS max_budget, MIN(budget) AS min_budget FROM departments;
medium gold: SELECT max(budget_in_billions) ,  min(budget_in_billions) FROM department;

eval_err_num:5
easy pred: SELECT AVG(num_employees) FROM departments WHERE rank BETWEEN 10 AND 15;
easy gold: SELECT avg(num_employees) FROM department WHERE ranking BETWEEN 10 AND 15;

eval_err_num:6
easy pred: SELECT name FROM heads WHERE state <> 'California';
easy gold: SELECT name FROM head WHERE born_state != 'California';

eval_err_num:7
hard pred: SELECT DISTINCT YEAR(department_creation_date) FROM departments WHERE secretary_name = 'Alabama' AND department_manager_name = 'Secretary';
hard gold: SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T3.born_state  =  'Alabama';

eval_err_num:8
easy pred: SELECT state FROM births WHERE heads >= 3;
easy gold: SELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3;

eval_err_num:9
hard pred: SELECT YEAR(department_created_date) AS year, COUNT(*) AS count FROM departments GROUP BY year ORDER BY count DESC LIMIT 1;
hard gold: SELECT creation FROM department GROUP BY creation ORDER BY count(*) DESC LIMIT 1;

eval_err_num:10
medium pred: SELECT department_name, COUNT(*) FROM employees WHERE temporary_acting_value = 'Yes' GROUP BY department_name;
medium gold: SELECT T1.name ,  T1.num_employees FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id WHERE T2.temporary_acting  =  'Yes';

eval_err_num:11
easy pred: SELECT COUNT(*) FROM acting_status;
easy gold: SELECT count(DISTINCT temporary_acting) FROM management;

eval_err_num:12
extra pred: SELECT COUNT(DISTINCT department_head) FROM department_head WHERE department_head NOT IN (SELECT department_head FROM department);
extra gold: SELECT count(*) FROM department WHERE department_id NOT IN (SELECT department_id FROM management);

eval_err_num:13
medium pred: SELECT DISTINCT age FROM heads WHERE occupation = 'Actor';
medium gold: SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes';

eval_err_num:14
extra pred: SELECT state FROM states WHERE secretary_of_treasury_department = 'John' AND secretary_of_homeland_security = 'Jane';
extra gold: SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Homeland Security';

eval_err_num:15
medium pred: SELECT department_id, department_name, COUNT(*) as num_heads FROM employees WHERE department_id IN () SELECT department_id FROM head GROUP BY department_id HAVING COUNT(*) > 1;
medium gold: SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1;

eval_err_num:16
medium pred: SELECT id, name FROM head WHERE name LIKE 'Ha%';
medium gold: SELECT head_id ,  name FROM head WHERE name LIKE '%Ha%';

eval_err_num:17
easy pred: SELECT COUNT(*) FROM farms;
easy gold: SELECT count(*) FROM farm;

eval_err_num:18
easy pred: SELECT COUNT(*) FROM farms;
easy gold: SELECT count(*) FROM farm;

eval_err_num:19
easy pred: SELECT COUNT(*) FROM farms WHERE type = 'horse' ORDER BY count(*) ASC;
easy gold: SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC;

eval_err_num:20
easy pred: SELECT farm, SUM(horses) FROM records GROUP BY farm ORDER BY SUM(horses) ASC;
easy gold: SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC;

eval_err_num:21
easy pred: SELECT host FROM competitions WHERE theme!= 'Aliens';
easy gold: SELECT Hosts FROM farm_competition WHERE Theme !=  'Aliens';

eval_err_num:22
easy pred: SELECT hosts FROM competitions WHERE theme!= 'Aliens';
easy gold: SELECT Hosts FROM farm_competition WHERE Theme !=  'Aliens';

eval_err_num:23
easy pred: SELECT theme, year FROM farm_competitions ORDER BY year ASC;
easy gold: SELECT Theme FROM farm_competition ORDER BY YEAR ASC;

eval_err_num:24
easy pred: SELECT theme FROM farm_competitions ORDER BY year ASC;
easy gold: SELECT Theme FROM farm_competition ORDER BY YEAR ASC;

eval_err_num:25
easy pred: SELECT AVG(horses) FROM farms WHERE total_horses > 5000;
easy gold: SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000;

eval_err_num:26
easy pred: SELECT AVG(horses) FROM farms WHERE total_horses > 5000;
easy gold: SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000;

eval_err_num:27
medium pred: SELECT MAX(number_of_cows) AS max_cows, MIN(number_of_cows) AS min_cows FROM farms;
medium gold: SELECT max(Cows) ,  min(Cows) FROM farm;

eval_err_num:28
medium pred: SELECT MAX(cows) AS max_cows, MIN(cows) AS min_cows FROM farms;
medium gold: SELECT max(Cows) ,  min(Cows) FROM farm;

eval_err_num:29
easy pred: SELECT COUNT(DISTINCT status) FROM cities;
easy gold: SELECT count(DISTINCT Status) FROM city;

eval_err_num:30
easy pred: SELECT COUNT(DISTINCT status) FROM users;
easy gold: SELECT count(DISTINCT Status) FROM city;

eval_err_num:31
easy pred: SELECT name FROM cities ORDER BY population DESC;
easy gold: SELECT Official_Name FROM city ORDER BY Population DESC;

eval_err_num:32
easy pred: SELECT name FROM cities ORDER BY population DESC;
easy gold: SELECT Official_Name FROM city ORDER BY Population DESC;

eval_err_num:33
medium pred: SELECT name, status FROM city WHERE population = (SELECT MAX(population) FROM city);
medium gold: SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1;

eval_err_num:34
medium pred: The official name and status of the city with the most residents is "New York City" and "Metropolitan Statistical Area".;
medium gold: SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1;

eval_err_num:35
medium pred: SELECT YEAR(competition_date) AS year, official_name(city) AS city_name FROM competitions WHERE year IN (SELECT YEAR(competition_date) FROM competitions) ORDER BY year ASC;
medium gold: SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID;

eval_err_num:36
medium pred: SELECT year, name FROM cities WHERE competition = 'Olympics';
medium gold: SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID;

eval_err_num:37
medium pred: SELECT city_name FROM cities WHERE city_name IN (SELECT city_name FROM competitions GROUP BY city_name HAVING COUNT(*) > 1);
medium gold: SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1;

eval_err_num:38
medium pred: SELECT name FROM cities WHERE name IN (SELECT name FROM cities WHERE host_competition > 1);
medium gold: SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1;

eval_err_num:39
extra pred: SELECT city, COUNT(*) as num_competitions FROM competitions WHERE city = (SELECT city FROM competitions GROUP BY city ORDER BY COUNT(*) DESC LIMIT 1) GROUP;
extra gold: SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1;

eval_err_num:40
extra pred: SELECT city, COUNT(*) as num_competitions FROM competitions GROUP BY city ORDER BY num_competitions DESC LIMIT 1;
extra gold: SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1;

eval_err_num:41
medium pred: SELECT theme FROM competitions WHERE host_city_population > 1000;
medium gold: SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000;

eval_err_num:42
medium pred: SELECT theme, host_city FROM competitions WHERE host_city_population > 1000;
medium gold: SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000;

eval_err_num:43
medium pred: SELECT status, AVG(population) FROM cities GROUP BY status;
medium gold: SELECT Status ,  avg(Population) FROM city GROUP BY Status;

eval_err_num:44
medium pred: SELECT city, status, AVG(population) FROM cities GROUP BY city;
medium gold: SELECT Status ,  avg(Population) FROM city GROUP BY Status;

eval_err_num:45
medium pred: SELECT status, COUNT(city) as num_cities FROM cities GROUP BY status ORDER BY num_cities DESC;
medium gold: SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC;

eval_err_num:46
medium pred: SELECT status, COUNT(*) as frequency FROM city_status GROUP BY status ORDER BY frequency ASC;
medium gold: SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC;

eval_err_num:47
hard pred: SELECT city, COUNT(status) as count FROM status GROUP BY city ORDER BY count DESC LIMIT 1;
hard gold: SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1;

eval_err_num:48
hard pred: SELECT city, COUNT(status) as count FROM users GROUP BY city ORDER BY count DESC LIMIT 1;
hard gold: SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1;

eval_err_num:49
hard pred: SELECT city_name FROM cities WHERE competition_status = 'Not Held';
hard gold: SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition);

eval_err_num:50
hard pred: SELECT name FROM cities WHERE competition_hosted = NULL;
hard gold: SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition);

eval_err_num:51
hard pred: SELECT status FROM cities WHERE population > 1500 AND population < 500;
hard gold: SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500;

eval_err_num:52
hard pred: SELECT status FROM cities WHERE population > 1500 AND population < 500;
hard gold: SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500;

eval_err_num:53
medium pred: SELECT name FROM cities WHERE population > 1500 OR population < 500;
medium gold: SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500;

eval_err_num:54
medium pred: SELECT name FROM cities WHERE population > 1500 OR population < 500;
medium gold: SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500;

eval_err_num:55
easy pred: SELECT * FROM cities WHERE status!= 'Village' ORDER BY rank ASC;
easy gold: SELECT Census_Ranking FROM city WHERE Status !=  "Village";

eval_err_num:56
easy pred: SELECT * FROM cities WHERE status!= 'Village' ORDER BY rank ASC;
easy gold: SELECT Census_Ranking FROM city WHERE Status !=  "Village";

eval_err_num:57
extra pred: SELECT course_name, COUNT(*) as num_students FROM enrollments GROUP BY course_name ORDER BY num_students DESC LIMIT 1;
extra gold: SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1;

eval_err_num:58
extra pred: SELECT name FROM courses WHERE registration_count = (SELECT MAX(registration_count) FROM courses);
extra gold: SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1;

eval_err_num:59
hard pred: SELECT id, COUNT(*) as num_courses FROM students WHERE courses_taken > 0 GROUP BY id ORDER BY num_courses ASC LIMIT 1;
hard gold: SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1;

eval_err_num:60
hard pred: SELECT id FROM students WHERE id IN (SELECT MIN(id) FROM students WHERE courses > 0);
hard gold: SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1;

eval_err_num:61
medium pred: SELECT first_name, last_name FROM candidates;
medium gold: SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id;

eval_err_num:62
medium pred: SELECT first_name, last_name FROM candidates;
medium gold: SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id;

eval_err_num:63
hard pred: SELECT id FROM students WHERE attendance = 0;
hard gold: SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance);

eval_err_num:64
hard pred: SELECT id FROM students WHERE attendance = 0;
hard gold: SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance);

eval_err_num:65
easy pred: SELECT id FROM students WHERE id IN (SELECT student_id FROM courses);
easy gold: SELECT student_id FROM student_course_attendance;

eval_err_num:66
easy pred: SELECT id FROM students WHERE id IN (SELECT student_id FROM courses);
easy gold: SELECT student_id FROM student_course_attendance;

eval_err_num:67
medium pred: SELECT student_id, course_name FROM students INNER JOIN courses ON students.course_id = courses.id;
medium gold: SELECT T1.student_id ,  T2.course_name FROM student_course_registrations AS T1 JOIN courses AS T2 ON T1.course_id = T2.course_id;

eval_err_num:68
hard pred: SELECT * FROM students WHERE registration_date = (SELECT MAX(registration_date) FROM students);
hard gold: SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1;

eval_err_num:69
hard pred: SELECT * FROM students WHERE registration_date = (SELECT MAX(registration_date) FROM students);
hard gold: SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1;

eval_err_num:70
medium pred: SELECT COUNT(*) FROM students WHERE course = 'English';
medium gold: SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English";

eval_err_num:71
medium pred: SELECT COUNT(*) FROM students WHERE course = 'English';
medium gold: SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English";

eval_err_num:72
medium pred: SELECT COUNT(*) FROM courses WHERE student_id = 171;
medium gold: SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171;

eval_err_num:73
medium pred: SELECT COUNT(*) FROM courses WHERE student_id = 171;
medium gold: SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171;

eval_err_num:74
medium pred: SELECT id FROM candidates WHERE email ='stanley.monahan@example.org';
medium gold: SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org";

eval_err_num:75
medium pred: SELECT id FROM candidates WHERE email ='stanley.monahan@example.org';
medium gold: SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org";

eval_err_num:76
medium pred: SELECT id FROM candidates WHERE access_date = (SELECT MAX(access_date) FROM candidates);
medium gold: SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1;

eval_err_num:77
medium pred: SELECT id FROM candidates WHERE access_date = (SELECT MAX(access_date) FROM candidates);
medium gold: SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1;

eval_err_num:78
extra pred: SELECT * FROM students WHERE courses_taken = (SELECT MAX(courses_taken) FROM students);
extra gold: SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1;

eval_err_num:79
extra pred: SELECT student_name, COUNT(course_id) AS num_courses FROM student_courses GROUP BY student_name ORDER BY num_courses DESC LIMIT 1;
extra gold: SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1;

eval_err_num:80
medium pred: SELECT id, COUNT(*) FROM students WHERE courses > 0 GROUP BY id;
medium gold: SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id;

eval_err_num:81
medium pred: SELECT student_id, COUNT(course_id) FROM student_course GROUP BY student_id;
medium gold: SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id;

eval_err_num:82
hard pred: SELECT course_name, COUNT(student_id) FROM students GROUP BY course_name;
hard gold: SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id;

eval_err_num:83
hard pred: SELECT course_id, COUNT(student_id) AS num_students, course_name FROM students GROUP BY course_id;
hard gold: SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id;

eval_err_num:84
easy pred: SELECT id FROM candidates WHERE assessment_code = 'Pass';
easy gold: SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass";

eval_err_num:85
easy pred: SELECT id FROM candidates WHERE outcome_code = 'Pass';
easy gold: SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass";

eval_err_num:86
hard pred: SELECT mobile_number FROM candidates WHERE assessment_code = 'Fail';
hard gold: SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail";

eval_err_num:87
hard pred: SELECT cell_phone_number FROM candidates WHERE assessment_code = 'Fail';
hard gold: SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail";

eval_err_num:88
easy pred: SELECT id FROM students WHERE course_id = 301;
easy gold: SELECT student_id FROM student_course_attendance WHERE course_id  =  301;

eval_err_num:89
easy pred: SELECT id FROM students WHERE course_id = 301;
easy gold: SELECT student_id FROM student_course_attendance WHERE course_id  =  301;

eval_err_num:90